app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG','PG-13','R'))  ORDER BY release_date
---
    def index
      # @movies = Movie.all
      @all_ratings = Movie.all_ratings
      @selected_ratings = @all_ratings

      # select ratings

      # if not (params[:ratings] == nil || params[:ratings].empty?)
      if params[:ratings].kind_of?(Hash)
        @selected_ratings = params[:ratings].keys
        @movies = Movie.with_ratings(@selected_ratings).order(params[:sort])